## Essential - required for dotfiles setup
brew "eza"
brew "mise"
brew "neovim"
brew "tree-sitter-cli"  # nvim-treesitter parser compilation
brew "imagemagick"   # nvim image.nvim dependency
brew "mermaid-cli"   # nvim mermaid diagram rendering
brew "whisper-cpp"   # nvim whisper.nvim local speech-to-text
brew "prettierd"
brew "ripgrep"
brew "starship"
brew "stow"
brew "stylua"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"

## CLI Tools
brew "gh"
brew "jq"
brew "the_silver_searcher"
brew "tree"
# brew "libyaml"
# brew "telnet"
# brew "watch"
# brew "wget"
# brew "yamllint"
# brew "yq"

## Editors & IDEs
cask "gitkraken"
cask "zed"
# cask "android-studio"
# cask "postman"
# cask "visual-studio-code"

## AI Tools
cask "claude-code"

## Cloud & Infrastructure
brew "ansible"
brew "awscli"
brew "hashicorp/tap/terraform"
cask "gcloud-cli"

## Secrets & Auth
brew "age"
brew "gnupg"
brew "sops"
cask "1password"
cask "1password-cli"

## Kubernetes
brew "kubectx"
cask "rancher"

## Homelab
brew "borgbackup"
brew "fluxcd/tap/flux"
brew "talhelper"

## Networking & Privacy
cask "little-snitch"
cask "mullvad-vpn"
cask "tailscale-app"

## Browsers
cask "mullvad-browser"
# cask "firefox"
# cask "google-chrome"
# cask "ungoogled-chromium"
