## Essential - required for dotfiles setup
brew "eza"
brew "mise"
brew "starship"
brew "stow"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"

## Neovim
brew "neovim"
brew "tree-sitter-cli" # nvim-treesitter parser compilation
brew "imagemagick"     # image.nvim
brew "mermaid-cli"     # mermaid diagram rendering
brew "prettierd"       # conform.nvim formatter
brew "ripgrep"         # telescope.nvim live_grep
brew "stylua"          # conform.nvim formatter
brew "whisper-cpp"     # whisper.nvim local speech-to-text

## Git & GitHub
brew "gh"        # extensions managed in 05-git.sh
brew "git-delta" # diff pager, configured in 05-git.sh
cask "gitkraken"

## CLI Tools
brew "fzf"                 # fuzzy finder, gco + keybindings in dotfiles
brew "jq"
brew "the_silver_searcher"
brew "tree"
# brew "atuin"             # shell history w/ sync, evaluate
# brew "libyaml"
# brew "telnet"
# brew "watch"
# brew "wget"
# brew "yamllint"
# brew "yq"

## Editors & IDEs
cask "zed"
# cask "android-studio"
# cask "postman"
# cask "visual-studio-code"

## AI Tools
cask "claude-code"

## Cloud & Infrastructure
brew "ansible"
brew "awscli"
brew "hashicorp/tap/terraform"
cask "gcloud-cli"

## Secrets & Auth
brew "age"
brew "gnupg"
brew "sops"
cask "1password"
cask "1password-cli"

## Kubernetes
brew "fluxcd/tap/flux"
brew "kubectx"
brew "talhelper"
cask "rancher"

## Browsers
cask "ungoogled-chromium" # mermaid-cli puppeteer backend
# cask "firefox"
# cask "google-chrome"
