## Essential - required for dotfiles setup
brew "stow"
brew "mise"
brew "tmux"
brew "neovim"
brew "eza"
brew "ripgrep"
brew "prettierd"
brew "stylua"
brew "starship"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

## CLI Tools
brew "gh"
brew "tree"
brew "wget"
brew "jq"
brew "yt-dlp"
brew "ffmpeg"
brew "libyaml"
brew "the_silver_searcher"
brew "yamllint"
brew "watch"
brew "telnet"

## Secrets Management
brew "age"
brew "sops"
brew "gnupg"
cask "1password-cli"
cask "1password"
cask "gcloud-cli"

## Editors
cask "claude-code"
cask "ghostty"
cask "gitkraken"
# cask "visual-studio-code"

## Browsers
cask "mullvad-vpn"
cask "mullvad-browser"
cask "eloston-chromium"
# cask "firefox"
# cask "google-chrome"

## Kubernetes Development
cask "rancher"
brew "kubectx"

## Mobile Development
cask "android-studio"

## Productivity Applications
cask "obsidian"
cask "meetingbar"

## Utility Applications
cask "swish"
cask "raycast"
cask "hiddenbar"
# cask "discord"
cask "anydesk"



