## Essential - required for dotfiles setup
brew "stow"
brew "mise"
brew "tmux"
brew "neovim"
brew "eza"
brew "ripgrep"
brew "prettierd"
brew "stylua"
brew "starship"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

## CLI Tools
brew "gh"
brew "tree"
brew "jq"
brew "the_silver_searcher"

## CLI Tools (ad hoc)
# brew "ffmpeg"
# brew "libyaml"
# brew "telnet"
# brew "watch"
# brew "wget"
# brew "yamllint"
# brew "yq"
# brew "yt-dlp"

## Cloud & Infrastructure
brew "awscli"
brew "ansible"
brew "hashicorp/tap/terraform"
cask "gcloud-cli"

## Secrets & Auth
cask "1password"
cask "1password-cli"
brew "age"
brew "sops"
brew "gnupg"

## Editors & Terminal
cask "gitkraken"
cask "ghostty"
cask "claude-code"
cask "zed"
# cask "visual-studio-code"

## Kubernetes
cask "rancher"
brew "kubectx"

## Mobile Development
cask "android-studio"

## Networking & Privacy
cask "mullvad-vpn"
cask "mullvad-browser"
cask "tailscale"
cask "little-snitch"
cask "eloston-chromium"
# cask "google-chrome"

## Media
cask "iina"
cask "calibre"

## Audio
cask "soundsource"
cask "loopback"

## Utilities
cask "the-unarchiver"
cask "balenaetcher"
cask "cleanshot"

## Productivity
cask "obsidian"
cask "raycast"
cask "slack"
cask "meetingbar"
cask "swish"
cask "hiddenbar"
cask "anydesk"
# cask "discord"

